Repository: localhots/TokenEater
Catalog: Shared/*.lproj/Localizable.strings
Languages: fr

# menubar.refresh
source: Refresh
fr: Rafraîchir

# menubar.settings
source: Settings
fr: Réglages

# menubar.quit
source: Quit
fr: Quitter

# menubar.hide
source: Hide from menu bar
fr: Masquer de la barre

# menubar.show
source: Show in menu bar
fr: Afficher dans la barre

# menubar.updated
source: Updated %@
fr: Mis à jour %@

# metric.weekly
source: Weekly
fr: Hebdo

# widget.weekly
source: Weekly
fr: Hebdo

# widget.session.subtitle
source: 5h sliding window
fr: Fenêtre glissante 5h

# widget.weekly.full
source: Weekly
fr: Hebdomadaire

# widget.sonnet.subtitle
source: Dedicated limit
fr: Limite dédiée

# widget.offline
source: Offline
fr: Hors ligne

# widget.loading
source: Loading...
fr: Chargement...

# widget.soon
source: Soon
fr: Bientôt

# widget.updated
source: Upd. %@
fr: Maj %@

# widget.refresh.button
source: Refresh
fr: Rafraîchir

# widget.description.usage
source: Monitor your Claude usage in real time
fr: Affiche votre consommation Claude en temps réel

# widget.description.pacing
source: Your Claude usage pace
fr: Votre rythme de consommation Claude

# settings.subtitle
source: Monitor your Claude usage
fr: Surveillez votre consommation Claude

# settings.test
source: Test
fr: Tester

# settings.refresh
source: Refresh
fr: Rafraîchir

# settings.testing
source: Testing...
fr: Test en cours...

# settings.menubar.toggle
source: Show in menu bar
fr: Afficher dans la barre de menu

# settings.menubar.title
source: Menu bar
fr: Barre de menu

# settings.tab.connection
source: Connection
fr: Connexion

# settings.tab.display
source: Display
fr: Affichage

# settings.metrics.pinned
source: Pinned metrics
fr: Métriques épinglées

# settings.metrics.pinned.footer
source: Choose which metrics appear in the menu bar.
fr: Choisissez les métriques affichées dans la barre de menu.

# settings.pacing.display
source: Pacing display
fr: Affichage rythme

# settings.pacing.dot
source: Dot only
fr: Point seul

# settings.pacing.dotdelta
source: Dot + delta (%)
fr: Point + delta (%)

# settings.proxy.toggle
source: Enable SOCKS5 proxy
fr: Activer le proxy SOCKS5

# settings.proxy.footer
source: Useful behind a corporate firewall via an SSH tunnel.
fr: Utile derrière un firewall corporate via un tunnel SSH.

# settings.proxy.config
source: Proxy configuration
fr: Configuration proxy

# settings.proxy.host
source: Host
fr: Hôte

# settings.proxy.hint
source: Example: ssh -D 1080 user@bastion then enable the proxy here.
fr: Exemple : ssh -D 1080 user@bastion puis activez le proxy ici.

# connect.button
source: Connect
fr: Connexion

# connect.subtitle
source: Auto-detect Claude Code OAuth token
fr: Détection auto du token OAuth Claude Code

# connect.oauth.success
source: Connected via Claude Code
fr: Connecté via Claude Code

# connect.noclaudecode
source: Claude Code not detected. Install it and sign in first.
fr: Claude Code non détecté. Installez-le et connectez-vous d'abord.

# guide.title
source: Setup Guide
fr: Configuration

# guide.oauth.badge
source: Recommended
fr: Recommandé

# guide.oauth.step1
source: Install **Claude Code** (Anthropic's CLI)
fr: Installez **Claude Code** (le CLI d'Anthropic)

# guide.oauth.step2
source: Open TokenEater and click **Connect**
fr: Ouvrez TokenEater et cliquez sur **Connecter**

# guide.oauth.step3
source: Done — token refreshes automatically
fr: Terminé — le token se rafraîchit automatiquement

# guide.widget
source: Add the widget
fr: Ajouter le widget

# guide.widget.detail
source: Right-click desktop > **Edit Widgets** > **TokenEater**
fr: Clic droit sur le bureau > **Modifier les widgets** > **TokenEater**

# error.notoken
source: No OAuth token found. Install Claude Code and click Connect.
fr: Aucun token OAuth trouvé. Installez Claude Code et cliquez sur Connexion.

# error.tokenexpired
source: OAuth token expired — relaunch Claude Code to refresh it
fr: Token OAuth expiré — relancez Claude Code pour le rafraîchir

# error.invalidurl
source: Invalid URL
fr: URL invalide

# error.invalidresponse
source: Invalid server response
fr: Réponse invalide du serveur

# error.http
source: HTTP error %d
fr: Erreur HTTP %d

# error.network
source: Network error: %@
fr: Erreur réseau : %@

# error.invalidresponse.short
source: Invalid response
fr: Réponse invalide

# error.keychainlocked
source: Keychain locked — will retry automatically
fr: Keychain verrouillé — nouvelle tentative automatique

# error.unsupportedplan
source: Usage data not available — Claude Pro or Team plan required
fr: Données d'utilisation indisponibles — un plan Claude Pro ou Team est requis

# error.banner.expired
source: Token expired
fr: Token expiré

# error.banner.expired.hint
source: Run /login in Claude Code — TokenEater will pick it up automatically
fr: Lancez /login dans Claude Code — TokenEater le récupérera automatiquement

# error.banner.keychain
source: Keychain locked
fr: Keychain verrouillé

# error.banner.keychain.hint
source: Will retry automatically — or open Settings to re-authorize
fr: Nouvelle tentative automatique — ou ouvrez les Réglages pour ré-autoriser

# test.success
source: Connected — Session: %d%%
fr: Connexion OK — Session : %d%%

# test.expired
source: Session expired or invalid (HTTP %d)
fr: Session expirée ou invalide (HTTP %d)

# test.http
source: HTTP error %d
fr: Erreur HTTP %d

# pacing.chill.1
source: Plenty of room
fr: Tranquille, t'as du stock

# pacing.chill.2
source: Claude's waiting, go wild
fr: Claude t'attend, envoie du lourd

# pacing.chill.3
source: Cruise mode on
fr: Mode cruise activé

# pacing.ontrack.1
source: Right on pace
fr: Pile dans le rythme

# pacing.ontrack.3
source: You're on track
fr: Tu gères

# pacing.hot.1
source: Easy there cowboy
fr: Doucement cowboy

# pacing.hot.2
source: Burning through it
fr: Tu flambes

# pacing.hot.3
source: Slow down
fr: Lève le pied

# pacing.label
source: Pacing
fr: Rythme

# notif.orange.body
source: You're past %d%% — consider slowing down
fr: Tu dépasses %d%% — lève le pied

# notif.red.body
source: Critical usage — limit almost reached
fr: Usage critique — limite presque atteinte

# notif.green.body
source: Usage reset — you're back in the green
fr: Usage réinitialisé — t'es de retour dans le vert

# notif.test.body
source: Notifications are working — you're all set!
fr: Les notifications fonctionnent — c'est bon !

# settings.notifications.status
source: Status
fr: Statut

# settings.notifications.on
source: Enabled
fr: Activées

# settings.notifications.off
source: Disabled
fr: Désactivées

# settings.notifications.unknown
source: Not set
fr: Non défini

# settings.notifications.enable
source: Enable
fr: Activer

# settings.notifications.open
source: Open Settings
fr: Ouvrir les réglages

# settings.notifications.test
source: Test
fr: Tester

# relative.now
source: now
fr: maintenant

# settings.tab.theming
source: Theming
fr: Apparence

# settings.theme.colors
source: Color Theme
fr: Thème de couleurs

# settings.theme.preset
source: Preset
fr: Préréglage

# settings.theme.custom
source: Custom
fr: Personnalisé

# settings.theme.custom.colors
source: Custom Colors
fr: Couleurs personnalisées

# settings.theme.gauge.normal
source: Gauge Normal
fr: Jauge normal

# settings.theme.gauge.warning
source: Gauge Warning
fr: Jauge attention

# settings.theme.gauge.critical
source: Gauge Critical
fr: Jauge critique

# settings.theme.pacing.chill
source: Pacing Chill
fr: Pacing détendu

# settings.theme.pacing.ontrack
source: Pacing On Track
fr: Pacing en rythme

# settings.theme.pacing.hot
source: Pacing Hot
fr: Pacing surchauffe

# settings.theme.widget.bg
source: Widget Background
fr: Fond du widget

# settings.theme.widget.text
source: Widget Text
fr: Texte du widget

# settings.theme.thresholds
source: Usage Thresholds
fr: Seuils d'utilisation

# settings.theme.warning
source: Warning
fr: Attention

# settings.theme.critical
source: Critical
fr: Critique

# settings.theme.menubar
source: Menu Bar
fr: Barre de menus

# settings.theme.monochrome
source: Monochrome menu bar
fr: Barre de menus monochrome

# settings.theme.preview
source: Preview
fr: Aperçu

# settings.theme.preview.warning
source: Warning
fr: Attention

# settings.theme.preview.critical
source: Critical
fr: Critique

# settings.theme.reset
source: Reset to Defaults
fr: Réinitialiser

# settings.theme.reset.confirm
source: Reset all theming settings?
fr: Réinitialiser tous les réglages d'apparence ?

# settings.theme.reset.cancel
source: Cancel
fr: Annuler

# settings.theme.reset.action
source: Reset
fr: Réinitialiser

# theme.default
source: Default
fr: Par défaut

# theme.neon
source: Neon
fr: Néon

# duration.days.hours
source: %dd %dh
fr: %dj %dh

# onboarding.continue
source: Continue
fr: Continuer

# onboarding.back
source: Back
fr: Retour

# onboarding.mode.detailed
source: Detailed
fr: Détaillé

# onboarding.welcome.subtitle
source: Keep an eye on your Claude usage
fr: Gardez un œil sur votre conso Claude

# onboarding.welcome.description
source: A menu bar widget that shows your Claude Code consumption at a glance.
fr: Un widget dans la barre de menu pour voir votre consommation Claude Code d'un coup d'œil.

# onboarding.prereq.checking
source: Looking for Claude Code…
fr: Recherche de Claude Code…

# onboarding.prereq.detected.title
source: Claude Code found!
fr: Claude Code trouvé !

# onboarding.prereq.detected.simple
source: TokenEater found Claude Code on your Mac. It'll use your existing session to fetch your usage data.
fr: TokenEater a trouvé Claude Code sur votre Mac. Il va utiliser votre session pour récupérer vos données d'usage.

# onboarding.prereq.detected.detailed
source: TokenEater found a Claude Code OAuth token in your macOS Keychain (service: Claude Code-credentials). It reads this token to call the Anthropic usage API.
fr: TokenEater a trouvé un token OAuth Claude Code dans le Keychain macOS (service : Claude Code-credentials). Il lit ce token pour appeler l'API usage d'Anthropic.

# onboarding.prereq.notfound.title
source: Claude Code not found
fr: Claude Code introuvable

# onboarding.prereq.step1
source: Install Claude Code (Anthropic's CLI)
fr: Installez Claude Code (le CLI d'Anthropic)

# onboarding.prereq.step2
source: Launch it and sign in with your Claude account
fr: Lancez-le et connectez-vous avec votre compte Claude

# onboarding.prereq.step3
source: Come back here and hit retry
fr: Revenez ici et cliquez sur réessayer

# onboarding.prereq.install.link
source: Get Claude Code
fr: Installer Claude Code

# onboarding.prereq.retry
source: Retry
fr: Réessayer

# onboarding.prereq.plan.required
source: Requires a Claude Pro or Team plan — the free plan doesn't expose usage data.
fr: Nécessite un plan Claude Pro ou Team — le plan gratuit ne fournit pas les données d'usage.

# onboarding.notif.title
source: Stay in the loop
fr: Restez informé

# onboarding.notif.simple
source: Get notified when your usage hits warning or critical levels.
fr: Recevez une notification quand votre usage atteint les seuils d'alerte.

# onboarding.notif.detailed
source: TokenEater sends local notifications when your usage crosses configurable thresholds (default: 60%% warning, 85%% critical). Only transitions trigger alerts — no spam.
fr: TokenEater envoie des notifications locales quand votre usage franchit les seuils configurables (60%% alerte, 85%% critique par défaut). Seules les transitions déclenchent une alerte — pas de spam.

# onboarding.notif.enable
source: Enable Notifications
fr: Activer les notifications

# onboarding.notif.enabled
source: Notifications enabled!
fr: Notifications activées !

# onboarding.notif.test
source: Send a test
fr: Envoyer un test

# onboarding.notif.denied.hint
source: No worries — you can enable them later in System Settings.
fr: Pas de souci — vous pourrez les activer plus tard dans les Réglages Système.

# onboarding.notif.open.settings
source: Open Settings
fr: Ouvrir les réglages

# onboarding.notif.skip.hint
source: You'll miss threshold alerts
fr: Vous manquerez les alertes de seuil

# onboarding.notif.mockup.body
source: You're past 60% — consider slowing down
fr: Tu dépasses 60%% — lève le pied

# onboarding.connection.title
source: One last thing
fr: Dernière étape

# onboarding.connection.simple
source: macOS will ask for your password — that's normal. It lets TokenEater securely read your Claude session.
fr: macOS va demander votre mot de passe — c'est normal. Ça permet à TokenEater de lire votre session Claude en toute sécurité.

# onboarding.connection.detailed
source: macOS protects the Keychain with your login password. TokenEater needs a one-time read via SecItemCopyMatching. Only the access token is copied — nothing else leaves the Keychain.
fr: macOS protège le Keychain avec votre mot de passe. TokenEater fait une lecture unique via SecItemCopyMatching. Seul l'access token est copié — rien d'autre ne sort du Keychain.

# onboarding.connection.authorize
source: Authorize
fr: Autoriser

# onboarding.connection.connecting
source: Connecting…
fr: Connexion…

# onboarding.connection.success.title
source: You're all set!
fr: C'est bon, tout roule !

# onboarding.connection.widget.hint
source: Add the widget: right-click desktop → Edit Widgets → TokenEater
fr: Ajoutez le widget : clic droit sur le bureau → Modifier les widgets → TokenEater

# onboarding.connection.start
source: Let's go
fr: C'est parti

# onboarding.connection.retry
source: Try again
fr: Réessayer

# onboarding.connection.failed.title
source: Something went wrong
fr: Quelque chose a planté

# onboarding.connection.failed.notoken
source: Couldn't read the token. Make sure Claude Code is installed and you're signed in.
fr: Impossible de lire le token. Vérifiez que Claude Code est installé et que vous êtes connecté.

# onboarding.connection.failed.tip
source: Try running /login in Claude Code even if you're already signed in — it can fix stale sessions.
fr: Essayez /login dans Claude Code même si vous êtes déjà connecté — ça peut débloquer une session expirée.

# settings.onboarding.reset
source: Run setup again
fr: Relancer la configuration
